tap "adtennant/tilengine"
tap "caskroom/fonts"
tap "danielbayley/adobe"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/science"
tap "homebrew/services"
tap "jonof/kenutils"
tap "potatolabs/git-redate"
# Tool for reverse engineering 3rd party, closed, binary Android apps
brew "apktool"
# MPEG-4 command-line tool
brew "atomicparsley"
# Programmable completion for Bash 3.2
brew "bash-completion"
# Collection of portable C++ source libraries
brew "boost"
# Interpreted, interactive, object-oriented programming language
brew "python"
# Vector graphics library with cross-device output support
brew "cairo"
# Like cat but displays content with syntax highlighting
brew "ccat"
# Cross-platform make
brew "cmake"
# Color-highlighted diff(1) output
brew "colordiff"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Perl lib for reading and writing EXIF metadata
brew "exiftool"
# Free lossless audio codec
brew "flac"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# C routines to compute the Discrete Fourier Transform
brew "fftw"
# Collection of GNU find, xargs, and locate
brew "findutils"
# GNU awk utility
brew "gawk"
# Distributed revision control system
brew "git"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# GNU grep, egrep and fgrep
brew "grep"
# Convert source code to formatted text with syntax highlighting
brew "highlight"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Joe's Own Editor (JOE)
brew "joe"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Library to render SVG files using Cairo
brew "librsvg"
# YAML Parser
brew "libyaml"
# Mac App Store command-line interface
brew "mas"
# MP3 player for Linux and UNIX
brew "mpg123"
# Node version management
brew "n"
# Port scanning utility for large networks
brew "nmap"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Object-relational database system
brew "postgresql"
# Interpreted, interactive, object-oriented programming language
brew "python@2"
# Ruby version manager
brew "rbenv"
# Persistent key-value database, with built-in net interface
brew "redis", restart_service: true
# Perl-powered file rename script with many helpful built-ins
brew "rename"
# SOund eXchange: universal sound sample translator
brew "sox"
# Granddaddy of HTML tools, with support for modern standards
brew "tidy-html5"
# Terminal multiplexer
brew "tmux"
# CLI tool that moves files or folder to the trash
brew "trash"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Display word differences between text files
brew "wdiff"
# Internet file retriever
brew "wget"
# JavaScript package manager
brew "yarn", args: ["without-node"]
# Download YouTube videos from the command-line
brew "youtube-dl"
# UNIX shell (command interpreter)
brew "zsh"
# Change the dates of several git commits with a single command
brew "potatolabs/git-redate/git-redate"
cask "docker"
cask "iterm2"
cask "lulu"
cask "majestic"
cask "qlcolorcode"
cask "qlimagesize"
cask "qlmarkdown"
cask "qlprettypatch"
cask "qlstephen"
cask "qlvideo"
cask "quicklook-csv"
cask "quicklook-json"
cask "quicklookase"
cask "spotify"
cask "spotify-notifications"
cask "visual-studio-code"
cask "webpquicklook"
cask "caskroom/fonts/font-hack-nerd-font"
mas "GlucoGram", id: 1107429772
mas "JPEGmini", id: 498944723
mas "Memory Clean 2", id: 1114591412
mas "Resizer", id: 411277085
mas "ResolutionTab", id: 540141595
mas "RSS Bot", id: 605732865
mas "Slack", id: 803453959
mas "The Unarchiver", id: 425424353
mas "Xcode", id: 497799835
