tap "adoptopenjdk/openjdk"
tap "adtennant/tilengine"
tap "aws/tap"
tap "danielbayley/adobe"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "jonof/kenutils"
tap "paleite/versions"
tap "potatolabs/git-redate"
tap "remind101/formulae"
tap "sambadevi/powerlevel9k"
tap "scottrigby/macos-configurator"
tap "wix/brew"
# Search tool like grep, but optimized for programmers
brew "ack"
# Java build tool
brew "ant"
# Tool for reverse engineering 3rd party, closed, binary Android apps
brew "apktool"
# Interpreted, interactive, object-oriented programming language
brew "python@3.8"
# MPEG-4 command-line tool
brew "atomicparsley"
# Client for Amazon Elastic Beanstalk web service
brew "aws-elasticbeanstalk"
# Official Amazon AWS command-line interface
brew "awscli"
# Programmable completion for Bash 3.2
brew "bash-completion"
# Get/set bluetooth power and discoverable state
brew "blueutil"
# Collection of portable C++ source libraries
brew "boost"
# Vector graphics library with cross-device output support
brew "cairo"
# Like cat but displays content with syntax highlighting
brew "ccat"
# Cross-platform make
brew "cmake"
# Dependency manager for Cocoa projects
brew "cocoapods"
# Color-highlighted diff(1) output
brew "colordiff"
# Dependency Manager for PHP
brew "composer"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Tools to work with Android .dex and Java .class files
brew "dex2jar"
# Good-lookin' diffs with diff-highlight and more
brew "diff-so-fancy"
# Perl lib for reading and writing EXIF metadata
brew "exiftool"
# Free lossless audio codec
brew "flac"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# C routines to compute the Discrete Fourier Transform
brew "fftw"
# Collection of GNU find, xargs, and locate
brew "findutils"
# GNU awk utility
brew "gawk"
# Google Drive CLI Client
brew "gdrive"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Extensions to follow Vincent Driessen's branching model
brew "git-flow"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Reformats Java source code to comply with Google Java Style
brew "google-java-format"
# Open-source build automation tool based on the Groovy and Kotlin DSL
brew "gradle"
# Library to render SVG files using Cairo
brew "librsvg"
# GNU grep, egrep and fgrep
brew "grep"
# Development framework for multimedia applications
brew "gstreamer"
# GStreamer plugins for Libav (a fork of FFmpeg)
brew "gst-libav"
# GStreamer plugins less supported, not fully tested
brew "gst-plugins-bad"
# GStreamer plugins (well-supported, under the LGPL)
brew "gst-plugins-good"
# Library for constructing graphs of media-handling components
brew "gst-plugins-ugly"
# Convert source code to formatted text with syntax highlighting
brew "highlight"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Dex to Java decompiler
brew "jadx"
# Full featured terminal-based screen editor
brew "joe"
# Lightweight and flexible command-line JSON processor
brew "jq"
# YAML Parser
brew "libyaml"
# Text-based web browser
brew "lynx"
# Keep your Mac's application settings in sync
brew "mackup"
# Mac App Store command-line interface
brew "mas"
# Java-based project management
brew "maven"
# Matroska media files manipulation tools
brew "mkvtoolnix"
# Collection of tools that nobody wrote when UNIX was young
brew "moreutils"
# MP3 player for Linux and UNIX
brew "mpg123"
# Download YouTube videos from the command-line
brew "youtube-dl"
# Media player based on MPlayer and mplayer2
brew "mpv"
# Node version management
brew "n"
# Port scanning utility for large networks
brew "nmap"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Shell command parallelization utility
brew "parallel"
# Tool to automatically fix PHP coding standards issues
brew "php-cs-fixer"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Object-relational database system
brew "postgresql"
# Ruby version manager
brew "rbenv"
# Persistent key-value database, with built-in net interface
brew "redis", restart_service: true
# Perl-powered file rename script with many helpful built-ins
brew "rename"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Autoformat shell script source code
brew "shfmt"
# SOund eXchange: universal sound sample translator
brew "sox"
# Send macOS User Notifications from the command-line
brew "terminal-notifier"
# Granddaddy of HTML tools, with support for modern standards
brew "tidy-html5"
# Terminal multiplexer
brew "tmux"
# CLI tool that moves files or folder to the trash
brew "trash"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Secures, stores, and tightly controls access to secrets
brew "vault"
# Executes a program periodically, showing output fullscreen
brew "watch", link: false
# Watch files and take action when they change
brew "watchman"
# Display word differences between text files
brew "wdiff"
# Internet file retriever
brew "wget"
# JavaScript package manager
brew "yarn"
# UNIX shell (command interpreter)
brew "zsh"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# AWS SAM CLI 🐿 is a tool for local development and testing of Serverless applications
brew "aws/tap/aws-sam-cli"
# Change the dates of several git commits with a single command
brew "potatolabs/git-redate/git-redate"
# Easily assume AWS roles in your terminal
brew "remind101/formulae/assume-role"
# A badass zsh theme with more power than a normal earthling
brew "sambadevi/powerlevel9k/powerlevel9k"
# Compares plist files line by line
brew "scottrigby/macos-configurator/pldiff"
# AdoptOpenJDK OpenJDK (Java) Development Kit
cask "adoptopenjdk11"
# Communications service
cask "amazon-chime"
# Utility to create and modify archives
cask "betterzip"
# Web debugging Proxy application
cask "charles"
# Nintendo 3DS emulator
cask "citra"
# Disk usage utility
cask "disk-inventory-x"
# App to build and share containerized applications and microservices
cask "docker"
# Client for the Dropbox cloud storage service
cask "dropbox"
# Web browser
cask "firefox-nightly"
# Screen color temperature controller
cask "flux"
cask "font-hack-nerd-font"
# Desktop client for GitHub repositories
cask "github"
# Web browser
cask "google-chrome"
# Web browser
cask "google-chrome-canary"
# Tools to protect your emails and files
cask "gpg-suite"
# Light, Electron-based Wrapper around GraphiQL
cask "graphiql"
# Utility to reduce the size of 24-bit PNG files
cask "imagealpha"
# Tool to optimize images to a smaller size
cask "imageoptim"
# IDE for Java development - community edition
cask "intellij-idea-ce"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Open-source firewall to block unknown outgoing connections
cask "lulu"
# Open-source Markdown editor
cask "macdown"
# Media key forwarder for iTunes and Spotify
cask "macmediakeyforwarder"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Web browser
cask "microsoft-edge"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# Markdown-based note-taking app that doesn't suck
cask "notable"
# Collaboration platform for API development
cask "postman"
# Display image info and preview unsupported formats in QuickLook
cask "qlimagesize"
# QuickLook generator for Markdown files
cask "qlmarkdown"
cask "qlprettypatch"
cask "qlstephen"
cask "qlvideo"
cask "quicklook-csv"
cask "quicklook-json"
cask "quicklookase"
# Automatically hides or quits apps after periods of inactivity
cask "quitter"
# Web browser
cask "safari-technology-preview"
# Instant messaging application focusing on security
cask "signal"
cask "sketch43"
# Team communication and collaboration software
cask "slack"
# Graphical client for Git version control
cask "sourcetree"
# Move and resize windows with ease
cask "spectacle"
# Music streaming service
cask "spotify"
cask "spotify-notifications"
# Quicklook extension for source files
cask "syntax-highlight"
# Development environment
cask "vagrant"
# Free and open-source hosted hypervisor for x86 virtualization
cask "virtualbox"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
cask "webpquicklook"
# Desktop client for WhatsApp
cask "whatsapp"
# Video communication and virtual meeting platform
cask "zoom"
mas "Floating", id: 1508833245
mas "GlucoGram", id: 1107429772
mas "Jira", id: 1475897096
mas "JPEGmini", id: 498944723
mas "Keynote", id: 409183694
mas "Memory Clean 2", id: 1114591412
mas "Microsoft Outlook", id: 985367838
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Resizer", id: 411277085
mas "ResolutionTab", id: 540141595
mas "RSS Bot", id: 605732865
mas "The Unarchiver", id: 425424353
mas "Xcode", id: 497799835
