tap "adoptopenjdk/openjdk"
tap "adtennant/tilengine"
tap "caskroom/fonts"
tap "danielbayley/adobe"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "jonof/kenutils"
tap "paleite/versions"
tap "potatolabs/git-redate"
tap "sambadevi/powerlevel9k"
# cask "adoptopenjdk"
cask "adoptopenjdk8"
# Tool for reverse engineering 3rd party, closed, binary Android apps
brew "apktool"
# MPEG-4 command-line tool
brew "atomicparsley"
# Client for Amazon Elastic Beanstalk web service
brew "aws-elasticbeanstalk"
# Programmable completion for Bash 3.2
brew "bash-completion"
# Collection of portable C++ source libraries
brew "boost"
# Interpreted, interactive, object-oriented programming language
brew "python"
# Vector graphics library with cross-device output support
brew "cairo"
# Like cat but displays content with syntax highlighting
brew "ccat"
# Cross-platform make
brew "cmake"
# Dependency manager for Cocoa projects
brew "cocoapods"
# Color-highlighted diff(1) output
brew "colordiff"
# Dependency Manager for PHP
brew "composer"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Tools to work with Android .dex and Java .class files
brew "dex2jar"
# Good-lookin' diffs with diff-highlight and more
brew "diff-so-fancy"
# Perl lib for reading and writing EXIF metadata
brew "exiftool"
# Free lossless audio codec
brew "flac"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# C routines to compute the Discrete Fourier Transform
brew "fftw"
# Collection of GNU find, xargs, and locate
brew "findutils"
# GNU awk utility
brew "gawk"
# Google Drive CLI Client
brew "gdrive"
# Distributed revision control system
brew "git"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg", link: false
# Open source programming language to build simple/reliable/efficient software
brew "go"
# GNU grep, egrep and fgrep
brew "grep"
# Convert source code to formatted text with syntax highlighting
brew "highlight", link: false
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Dex to Java decompiler
brew "jadx"
# Joe's Own Editor (JOE)
brew "joe"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Library to render SVG files using Cairo
brew "librsvg"
# YAML Parser
brew "libyaml"
# Text-based web browser
brew "lynx"
# Keep your Mac's application settings in sync
brew "mackup"
# Mac App Store command-line interface
brew "mas"
# Collection of tools that nobody wrote when UNIX was young
brew "moreutils", link: false
# MP3 player for Linux and UNIX
brew "mpg123"
# Node version management
brew "n"
# Port scanning utility for large networks
brew "nmap"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Tool to automatically fix PHP coding standards issues
brew "php-cs-fixer"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Object-relational database system
brew "postgresql"
# Ruby version manager
brew "rbenv"
# Persistent key-value database, with built-in net interface
brew "redis", restart_service: true
# Perl-powered file rename script with many helpful built-ins
brew "rename"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# SOund eXchange: universal sound sample translator
brew "sox"
# Send macOS User Notifications from the command-line
brew "terminal-notifier"
# Granddaddy of HTML tools, with support for modern standards
brew "tidy-html5"
# Terminal multiplexer
brew "tmux"
# CLI tool that moves files or folder to the trash
brew "trash"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Secures, stores, and tightly controls access to secrets
brew "vault"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Watch files and take action when they change
brew "watchman"
# Display word differences between text files
brew "wdiff"
# Internet file retriever
brew "wget"
# JavaScript package manager
brew "yarn"
# Download YouTube videos from the command-line
brew "youtube-dl"
# UNIX shell (command interpreter)
brew "zsh"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Change the dates of several git commits with a single command
brew "potatolabs/git-redate/git-redate"
# A badass zsh theme with more power than a normal earthling
brew "sambadevi/powerlevel9k/powerlevel9k"
cask "adobe-creative-cloud"
cask "betterzip"
cask "charles"
cask "cyberduck"
cask "disk-inventory-x"
cask "docker"
cask "dropbox"
cask "flux"
cask "github"
cask "google-chrome"
cask "google-chrome-canary"
cask "gpg-suite"
cask "imagealpha"
cask "imageoptim"
cask "iterm2"
cask "lulu"
cask "macdown"
cask "majestic"
cask "mjml"
cask "notable"
cask "postman"
cask "qlcolorcode"
cask "qlimagesize"
cask "qlmarkdown"
cask "qlprettypatch"
cask "qlstephen"
cask "qlvideo"
cask "quicklook-csv"
cask "quicklook-json"
cask "quicklookase"
cask "sourcetree"
cask "spectacle"
cask "spotify"
cask "spotify-notifications"
cask "sublime-text"
cask "trailer"
cask "tunnelblick"
cask "visual-studio-code"
cask "webpquicklook"
cask "whatsapp"
cask "zeplin"
cask "caskroom/fonts/font-hack-nerd-font"
cask "paleite/versions/sketch43"
mas "GlucoGram", id: 1107429772
mas "JPEGmini", id: 498944723
mas "Memory Clean 2", id: 1114591412
mas "monday", id: 1298450641
mas "Resizer", id: 411277085
mas "ResolutionTab", id: 540141595
mas "RSS Bot", id: 605732865
mas "Slack", id: 803453959
mas "The Unarchiver", id: 425424353
mas "Xcode", id: 497799835
